{
    "bear": "Their herding blood gives them a strong body that, under all that fur, is quite lean. Able to spend all day in the field, the Bearded Collie has lots of endurance and power. Their agility and speed makes them great for herding and fetching balls alike! The Bearded Collie has become a popular family dog and outdoor companion. With their distinctively inquisitive eyes, Beardies rarely miss a beat and can keep up with anything thrown at them.",
    "wombat": "Wombats are short, stout, furry, and objectively quite adorable. They have thick fur that varies in color from species to species and individual to individual. Their fur can be light tan, sandy grey, deep brown, and even black. All three species are around 3 ft. long, and can weigh anywhere from 44 to 77 lbs. on average. They also have powerful front legs and claws used for digging and burrowing. There are virtually endless fun facts about these marsupials. They have a number of unusual and unique adaptations that will simple astound you! Learn more about wombats below.",
    "bat": "Though Bats come in many shapes and sizes, they follow the same general body shape. Their bodies are small and covered in fur, and their wings are modified hands/fingers. They elongated have finger bones and a thin membrane of skin known as a “patagium” runs between them to form a wing. While many species are small, they come in a variety of sizes. The smallest species has just a six-inch wingspan while the wingspan of the largest is over five feet across. Their weight ranges anywhere from less than an ounce to four pounds.",
    "squirrel": "With hundreds of species, squirrels could compile a hefty survival traits list. Different species have different survival methods, each as interesting as the last. There are many different species of squirrels, and many different places they call home! You can find these critters in tropical rainforests, polar regions, arid deserts, public parks, and urban jungles.",
    "coyote": "For the most part, their fur is light grey and red, with black and white hairs dispersed across the coat. Young pups are much darker, and usually more uniform in color, than adults. Coyote tracks are longer and less rounded than dogs, and much smaller than wolves. Despite their bad rep, the species as a whole is not threatened by human activity at this time. Unfortunately, they are still vilified and hated by many. Learn why these creatures are interesting and useful below!",
    "otter": "Breeders developed this breed to hunt otters, since, in those days, the fury little creatures would wreak havoc on the fish populations. Otterhounds could track their scent underwater and thus protect the fishermen’s livelihood. Today, otters exist in much smaller numbers and so does the Otterhound. This dog’s shaggy coat may be black and tan, liver and tan, tricolor, or wheaten.",
    "flamingo": "Lots of the points in “Description of the Flamingo” require additional facts, because flamingos are actually unbelievably interesting creatures! They are honestly really odd creatures, and have a number of traits unique among birds. There are six different species of flamingos spread across various parts of the globe. Regardless of the region, flamingos flock to shallow lakes and lagoons. They prefer shallow water, as they wade in search of food, and their prey thrives in shallow water conditions.",
    "pig": "The largest domestic Pig on record reached over 2,500 lbs. However, Pigs of that size generally cannot sustain that type of body weight and often die young. The largest wild Pigs reach up to 600 lbs. These creatures have a number of unique traits, adaptations, and behaviors. Learn more about what makes them so interesting, below.",
    "goat": "The various breeds come in a number of different sizes. The largest breeds reach about 2.5 feet tall at the shoulder and weigh up to 300 lbs. or more. Males generally reach larger sizes than females. These charismatic creatures have a number of interesting traits and adaptations. Learn more about what makes them unique, below.",
    "koala": "Most of these fuzzy animals are about two and a half feet long, and weigh at least 10 pounds. Males are larger and heavier than their female counterparts. Koalas in different regions also vary slightly in size and color. People love Koalas. They are cute, charismatic, and often become symbolic of Australia. Learn more about what makes these creatures unique below.",
    "goldfish": "People have bred a wide number of different colors, shapes, and sizes in these fish. Even their body shapes vary drastically. Their coloration varies, but includes white, orange, black, red, yellow, brown, and any combination of the above. Size also varies greatly depending on the fish. Some measure just an inch or two long, others surpass a foot in length. The largest recorded individual grew to a length of 19 in.",
    "seal": "Despite their glamorous looks, these dogs were bred as hunters. They were meant to do battle with otters, which wreaked havoc for farmers in Wales. The Sealy had to be quite tenacious to deal with their opponents’ sharp teeth! Today, the Sealyham Terrier retains the cheeky terrier personality. However, they are calmer than some small dogs indoors, and enjoy social settings, especially with their owners.",
    "cat": "Despite the immense variety of species, these aquatic creatures generally share a similar body shape. They have elongated bodies with long tails, and their pectoral fins usually stick outward from their bodies rather than downward. While most species measure at about three feet long, they range in size from about eight inches long to over five feet long. With such a wide variety of species to choose from, you can find any number of interesting traits and adaptations. Learn more about some individual catshark species below.",
    "lobster": "In some species the first pair of claws grow much larger than the rest. Each species varies slightly in color, ranging from brown, to blue, to orange and more. There’s more to lobsters than a hearty meal and economic value. These specialized creatures have a number of unique adaptations. Learn more about lobsters below.",
    "kangaroo": "Marsupials as a whole are interesting, and kangaroos in particular are figureheads for this class of mammals. In addition to the unique trait of carrying their young in a pouch, kangaroos posses a number of impressive survival traits. As you may have guessed based upon their numbers, kangaroos can survive in a number of different habitats. This is what has allowed their numbers to increase to such a large population. You can find kangaroos in wooded forests, savannahs, scrublands, deserts, grassy plains, and more.",
    "possum": "These creatures vary in size and appearance, but generally have the same body shape. They walk on all four legs, have long tails, and usually live fully or partially in trees. Possums vary in size, from positively tiny to the size of a large cat. The Tasmanian pygmy is the smallest species at just under 3 inches long. Conversely, bear cuscus are the largest at 2 feet long, plus a 2-foot tail! Their weight ranges anywhere from less than an ounce to over 10 pounds.",
    "rat": "What could we possibly tell you about this common pest that would make you say “Wow!” Read on to find out. Today, these rodents live almost exclusively in areas of human habitation. They live in ports, woodlands, dumps, sewers, barns, sheds, basements, attics, cities, suburbs, and more.",
    "tiger": "They have thick fur that varies in color, but is generally a burnished orange with vertical black stripes. Their stomachs, chests, and parts of their faces are white with black stripes. The fur around the neck and chest grows thicker, but not quite as long as a lion’s mane. Tigers are apex predators, and have fine-tuned anatomy and behavior for capturing large prey. From nose to their tail, these fearsome cats are perfectly adapted for hunting and survival.",
    "rhinoceros": "Rhinos are thought to be the second largest land animal, with the elephant being the largest. They have a robust, cylindrical body with a large head, relatively short legs, and short tail. The characteristic feature of these animals is a large horn in the middle of their faces; some species have a second, smaller horn. Rhinos are usually grey, black, or brown (though one species is called the “white rhino”), and average about 1.5 tons (1360 kg) in weight. The two rhino species of Africa are much larger than the three species found in Asia.",
    "dog": "This fish species is important both in its ecosystem and commercially. Learn more about this salmon, below. These fish change their habitats drastically as they grow. The newly hatched fry remain in their red and hide from predators. As juveniles, they form schools and swim to other streams, creeks, or estuaries. Once they grow larger, they swim to the ocean. Finally, when it comes time to spawn, they return to freshwater again.",
    "goose": "There are so many different species of geese, and each is interesting in its own right! Instead of tossing random facts, we will highlight a few notable species for your consideration. As a whole, geese live in a huge variety of habitats and ecosystems. For the most part, as waterfowl geese live in areas that are close to the water. Most species prefer living in and around freshwater, rather than salt or brackish water.",
    "hyena": "They have long forelegs and thick necks, and from their heads to their tails, their backs slope noticeably downward. Most species are tan or brown in color, with dark stripes or spots. Hyenas are unique predators that aren’t quite like big cats, but aren’t canines either. Each species has slightly different behavior, but all are incredibly interesting creatures!",
    "elephant": "Elephant seals differ from many other pinniped species, both in appearance and behavior. The elephant seal has a number of interesting and distinguishing characteristics. The Northern elephant seal species lives offshore in the open ocean most of the year. During breeding season, Northern elephant seals inhabit sandy beaches, both on offshore islands and on some parts of the mainland United States.",
    "cow": "Nowadays, Cows come in many shapes and sizes. They are large, hoofed mammals, though people have bred “dwarf” breeds in smaller sizes. These bovines range in size from the tiny Vechur, which stands just three feet tall, to the massive Chianina from Italy. This enormous breed grows over five feet tall, and weighs several thousand pounds! All of the different breeds of Cow are actually the same species. Learn a little more about a few fun breeds of these animals below.",
    "woodpecker": "These birds vary in size and plumage, but many species have similar body shapes. They range in size, anywhere from three inches to a foot and a half long. Woodpeckers come in a wide range of colors, but there are some similarities between species as well. Though their feathers may be black, white, brown, or tan, many have red accent feathers on the tops of their heads. All of these birds have zygodactyl feet, with two toes facing forward and two toes facing backward.",
    "lizard": "Lizards can be found in almost any color imaginable, and several can even change color to match their environment almost immediately. They have a spectacular range of observable adaptations, such as frills, horns, and even “wings” (flaps of skin on elongated ribs). Many lizards have bright-colored adaptations, such as a bright red dewlap (“throat-flag”), bright spots, or colored tongue, but these adaptations are often hidden to reduce detection by predators. All lizards are covered with scales, of which the outer layer is keratin, the same substance that makes up human hair and finger nails.",
    "okapi": "These interesting animals don’t just look strange, they have interesting behavior and characteristics as well! These endangered mammals are truly one of a kind in the animal kingdom. Okapi live exclusively in dense rainforests. They are perfectly adapted for forest living. Their coat pattern matches the forest, and is equipped for combating the frequent rainfall. They are shorter than their giraffe cousins to help them navigate through the trees. These animals are found exclusively in rainforest habitat.",
    "gorilla": "They have thick black fur across their bodies, save for their faces, the palms of their hands, and the bottoms of their feet. The subspecies that live in mountainous regions have even thicker fur than their counterparts. These intelligent apes have intrigued us for centuries. Sadly, warfare within the countries in which these apes live is directly impacting them. Learn more about what makes these unique creatures worth protecting below.",
    "chimpanzee": "They stand between 3.2 and 5.5 ft. tall, depending on the gender and subspecies. Males usually weigh more than females at 80 – 140 lbs. Females typically weigh between 60 and 110 lbs. or so. These primates are one of our closest living relatives. Learn about what makes these creatures so unique below.",
    "zebra": "Zebras are beautiful, hardy creatures that are built for survival in harsh environments. These captivating creatures can take on a lion, but are being threatened by human activity. Learn why zebras are wonderfully unique animals that deserve protection below. Most of these interesting animals prefer living in savanna woodlands and grasslands without trees. They cannot be found in deserts, wetlands, or rainforests. The mountain variety lives in rocky mountainous areas. Unfortunately, the availability of habitat for all zebras is shrinking, resulting in population decline.",
    "eagle": "Their size is usually the easiest way to distinguish these birds from the rest of the hawks. Their plumage, or feathers, varies greatly from species to species. Some species are uniform in color, while others have unique patterns or crests to set them apart. There are many different species of Eagle, and they are all incredibly impressive. Below we have highlighted some of the most interesting species and their most unique traits.",
    "parrot": "Though many species are quite similar, Parrots are an immensely diverse group of birds. They come in many different shapes, sizes, and colors. As a whole, all of them have curved bills and zygodactyl toes, with two facing forward and two facing backward. Their coloration varies from species to species, and some are orange, green, blue, yellow, red, black, white, and more. They range in size from just 3 inches to over 36 inches long! The heaviest species, the kakapo, weighs up to 8 pounds.",
    "panda": "Pandas, like most bears, have short tails, measuring between 4 and 6 inches long. They are moderately large bears, and males can weigh up to 350 lbs. or more. However, most pandas average between 220 and 254 pounds or so. These bears are possibly the most famous icons for endangered species. Despite this, most people have very limited basic information of pandas past “eats bamboo.”",
    "raccoon": "Raccoons are easily recognizable mammals, with lots of fur and a number of distinguishing characteristics. If their bandit’s mask doesn’t give them away, their striped “jailbird” tail will. The area around the black markings over their eyes is white, and the rest of their body is a greyish color interspersed with lighter tan accents. Their paws are extremely sensitive and dexterous, and though they lack opposable thumbs they are quite proficient at manipulating objects.",
    "porcupine": "The Old World species have spines that are grouped into clusters, while the New World species have spines that are attached to the skin singly. Most are dark colored, with lighter colored spines or spine tips. It is no secret that these prickly creatures are unique! Each species is different, yet all have a few similar qualities.",
    "horse": "Horses have long necks, long legs, and singular solid hooves on the ends of their feet. Through years of breeding, humans have developed many different colors and patterns in their fur. Some of the most common colors are grey, dark reddish-brown (known as “bay”), and light brown (known as “chestnut”). Different breeds range drastically in size. Miniature Horses, the smallest of the breeds, measure under 3 ft. tall at the shoulder, and weigh around 200 lbs. Contrastingly, Shires are the largest breed, standing nearly 6 ft. tall and weighing up to 2,400 lbs. or more.",
    "jellyfish": "Size varies drastically from species to species. Some measure less than an inch across, while others reach six feet in diameter or more! The immense variety of species possess a number of different traits and adaptations. Learn more about what makes a few specific species unique, below.",
    "deer": "As discussed above, these little mice have deer-like coloration. Their fur ranges from light brown to deep brown, and their underbellies are white or cream colored. These rodents have rounded ears and large eyes. Most species measure between four and nine inches in length, including their tails. Their weight ranges, but most weigh no more than an ounce.",
    "reindeer": "Despite their inability to fly, reindeer are actually quite intriguing creatures. They have a number of different characteristics that make them unique among other deer, and are incredible survivors. While these animals are found across the globe in polar regions, they are found in generally one of two types of habitats. Some inhabit vast, open tundra, while others live along the edges and amongst forests. The only forests found in these areas are boreal forests, also known as “taiga,” or “snow” forests.",
    "dolphin": "Though each species has its own unique morphology, or shape, most members of this group share a similar form. They have elongated, streamlined bodies with one dorsal fin on their backs, two pectoral fins underneath, and a tail, or caudal, fin. Sizes range from about 5 ft. long to over 30 ft., depending on the species. Some species weigh just over 100 lbs. while others can weigh several tons.",
    "sheep": "The various breeds come in a number of different sizes. They stand about 3 ft. tall at the shoulder on average, and larger individuals can weigh up to 350 lbs. or more. Males generally reach larger sizes than females. These well-known creatures have a number of interesting traits and adaptations. Learn more about what makes them unique, below.",
    "wolf": "Like all wolf snakes, this species has enlarged teeth, giving it the name “wolf” snake. These teeth do not inject venom, but their rear fangs do. These snakes are usually around three feet long, though many individuals are smaller. Because of their uniquely shaped teeth, they have a relatively square snout. Their scales range in color from black to reddish brown, and they have various speckles and patterns of lighter color across their bodies.",
    "hummingbird": "Hummingbirds are highly specialized creatures. Their metabolism, body design, appendages, and behavior all rotate around utilizing flowers as a food source. Hummingbird species can be found in a number of different habitats. They can be found in temperate and even alpine mountain climates, but are found mostly in the tropics and subtropics. The greatest numbers of hummingbird species can be found in Central and South America, particularly in subtropical and tropical rainforests.",
    "donkey": "This large equid looks quite similar to a horse. Their bodies are stout, and their legs are relatively short. They have much longer ears than horses, and their necks are muscular and thick. Most measure about 4 ft. tall at the shoulder and weigh about 500 lbs. or so. Most people can easily recognize a Donkey with its long ears and stout bodies. Learn more about what makes these creatures so unique below.",
    "crow": "These seemingly mundane birds are actually incredibly smart and charismatic. Crows are some of the smartest birds in the world, and can rival parrots in their intellect! Crows are distributed across the planet in virtually every environment. These extremely adaptable birds can be found in urban environments as well, utilizing every habitat possible. They can be found in forests, grasslands, agricultural areas and farmland, mountains, deserts, arctic tundra, and rocky cliffs.",
    "swan": "Swans are the largest members of the Anatidae family, and the largest Swan species is the Trumpeter Swan. At their largest, their wingspan grows up to 10 ft. across. They also weigh up to 30 lbs. at their largest, though most weigh around 15 lbs. or so. These large birds also have incredibly long necks, which they often curve to rest on their backs while swimming. Some species are white, while others are black, off-white, or black and white.",
    "fox": "This species looks much like your typical “squirrel” with its long bushy tail. The coat is buff brownish-gray, with orange undertones. It grows quite large, reaching lengths of up to two feet long, not including the tail! Particularly hefty individuals surpass two pounds or more in weight. You can commonly find these rodents throughout the eastern United States, and into Canada and Mexico. So, what exactly makes this frequently spotted creature so unique? Learn more, below.",
    "turkey": "Domestic Turkeys are much larger than their wild counterparts. Humans have spent thousands of years selectively breeding these fowl into fatter and friendlier birds. Because of this breeding, domestic Turkeys weigh nearly 30 lbs. on average, and the largest weigh over 80 lbs. or more! This breeding also gives us a variety of colors, including brown, bronze, black, white, and more.",
    "lion": "This is an interesting and hardy fish. While these fish are a serious threat in the Atlantic as an invasive species, they are still beautiful and intriguing animals. These fish are found mainly in shallow coral reef environments, though they can occasionally be found in deeper water. They frequently inhabit tropical and subtropical waters, and they appear to prefer coastal areas and protected harbors for establishing territories. They hunt on the edges of reefs, lagoons, and rock formations.",
    "leopard": "Males of the species are larger than the females, and can stand up to 28 in. tall at the shoulder. They can weigh nearly 200 lbs., though females usually weigh much less. Leopards in different regions can vary drastically in size. These big cats are impressive hunters, and quite powerful creatures. humans respect and fear them across their range because of this. Learn more about these interesting cats below.",
    "pigeon": "Wild, non-domesticated pigeons are bluish-gray in color with two black bars on each wing and iridescent green and purple necks. Other color variations of “pigeons” are actually domesticated birds that have escaped and become feral. Their eyes are usually bright orange, but may also be red or gold colored. they have a whitish patch, known as a cere, on the ridge that connects their beak to their face. Though widely seen as pests, these birds are actually quite interesting. They have some very intriguing behavior patterns and adaptations.",
    "hedgehog": "These creatures measure between 8 and 10 inches long. Depending on the species, Hedgehogs generally weigh between 1 and 2.5 pounds. Despite their prickly exterior, people enjoy keeping these creatures as pets. Learn what makes Hedgehogs unique below.",
    "fly": "They range in size from 3.5 to 8 inches long. Their plumage, or feathers, is usually brown or tan, but some species have brighter coloration or bold patterns. Some other colors include black, white, grey, orange, blue, yellow, and more. Researchers recognize hundreds of different species in the Muscicapidae family. With so many species to choose from, you have many different unique adaptations and traits. Learn more about some individual species below.",
    "badger": "Like all of these animals, European or Eurasian Badgers have stout bodies and short legs. They measure about 2.5 ft. long and generally weigh between 15 and 40 lbs. or so. Their fur coloration is primarily grey across their back and sides. The fur on their legs and across their eyes is black, while the rest of their heads and underbellies are white. Different subspecies of Europeans have slightly different patterns and colors.",
    "snake": "These creatures have long bodies, tapered tails, and no legs. Though some species do have rough scales, in the vast majority the scales carefully overlap one another. This means their skin in smooth when you rub in the direction of the scales. With such an incredible range of species, it is no surprise that these reptiles come in a variety of sizes. The smallest species grow just 4 in. long as adults, while the largest species exceed 22 ft. long or more!",
    "hippopotamus": "Despite their weight, they have quite short legs with webbed toes. Because they are mostly aquatic they don’t need long legs to support their weight. They also sport a huge pair of jaws, which can open an impressive 180º wide. They also sport incisor teeth that can grow to over a foot long! Hippopotami (plural for hippopotamus) are simply brimming with amazing adaptations. They are perfectly built for survival in their aquatic African habitats, and are highly specialized creatures.",
    "hamster": "Adults range in size depending on the species. These rodents measure anywhere from about 2 inches, to 13 inches long. At their heaviest, some species reach nearly a pound! These rodents come in many different colors, shapes, and sizes. Learn more about a few individual species and their unique traits, below.",
    "duck": "Some species are quite small, while others are larger, but they are smaller than geese and swans. They also have relatively long necks, but again, shorter than geese and swans. The largest species is the Muscovy duck, which grows up to nine pounds. There are just so many different species of these interesting waterfowl, so Instead of throwing random facts at you, we will highlight some of the most unique duck species around below!",
    "antelope": "Males always have horns, but in some species, the females do not. Some species have horns that twist in intricate spirals, some are ridged or corrugated, and others grow in wide sweeping curves finishing in a sharp point. Their horns may grow up to 5 ft (1.5 m) in length. Due to the large number of antelope species, they have a great diversity of characteristics, behaviors and lifestyles. This means there are several interesting facts about antelopes.",
    "mouse": "A mouse is a small mammal. Characteristically, mice are known to have a pointed snout, small rounded ears, a body-length scaly tail, and a high breeding rate. The best known mouse species is the common house mouse (Mus musculus). Mice are also popular as pets. In some places, certain kinds of field mice are locally common. They are known to invade homes for food and shelter. ",
    "beetle": "Beetles are insects that form the order Coleoptera (/koʊliːˈɒptərə/), in the superorder Endopterygota. Their front pair of wings are hardened into wing-cases, elytra, distinguishing them from most other insects. The Coleoptera, with about 400,000 described species, is the largest of all orders, constituting almost 40% of described insects and 25% of all known animal life-forms; new species are discovered frequently, with estimates suggesting that there are between 0.9 to 2.1 million total species",
    "mosquito": "Mosquitoes are members of a group of almost 3,600 species of small flies within the family Culicidae (from the Latin culex meaning. The word mosquito is Spanish and Portuguese for little fly Mosquitoes have a slender segmented body, one pair of wings, one pair of halteres, three pairs of long hair-like legs, and elongated mouthparts. ",
    "octopus": "Octopuses (or octopi, if you prefer) are cephalopods, invertebrates that also include squid and cuttlefish. They have bulbous heads, large eyes, and eight very useful arms. “Cephalopod” is Greek for “head-foot,” which makes sense, since their limbs are attached directly to their head.",
    "bison": "These creatures look somewhat like a large cow, and are in the same family, Bovidae. They have thick brown coats that shed during the summer. Males are somewhat larger than females, tending to weigh quite a bit more. Both sexes do, however, possess horns atop their large heads, unlike some members of the Bovidae family. These horns are short, and curve upwards away from the face.",
    "hare": "Hares and jackrabbits are mammals belonging to the genus Lepus. They are herbivores, and live solitarily or in pairs. They nest in slight depressions called forms, and their young are able to fend for themselves shortly after birth. The genus includes the largest lagomorphs. Most are fast runners with long, powerful hind legs, and large ears to dissipate body heat.",
    "seahorse": "They are unique in appearance, with their horselike head, prehensile tail, independently moving eyes, and brood pouch. They have long, tubular snouts and small, toothless mouths. Their bodies are covered with consecutive rings of bony plates.",
    "owl": "Owls have round, forward-looking eyes, a sharply hooked beak, and acute hearing and vision. They are 5–28 in. (13–70 cm) long. The feathers of some species form a disk framing the face or ear tufts that help locate prey by reflecting sound to the ears.",
    "ox": "An ox also known as a bullock, is a male bovine trained and used as a draft animal. Oxen are commonly castrated adult male cattle; castration inhibits testosterone and aggression, which makes the males docile and safer to work with.",
    "cockroach": "The cockroach is characterized by a flattened oval body, long threadlike antennae, and a shining black or brown leathery integument. The head is bent downward, and the mouthparts point backward instead of forward or downward as is the case in most other insects.",
    "moth": "Compared with butterflies, moths have stouter bodies and duller colouring. Moths also have distinctive feathery or thick antennae. When at rest, moths either fold their wings tentlike over the body, wrap them around the body, or hold them extended at their sides, whereas butterflies hold their wings vertically.",
    "caterpillar": "A caterpillar is a fuzzy, worm-like insect that transforms into a butterfly or a moth. Many caterpillars are striped and colorful. A caterpillar is officially the larva, or immature form, of a flying insect — generally, a butterfly.",
    "crab": "Crabs are decapod crustaceans which have a very short tail and are covered with a thick shell, or exoskeleton and are armed with a single pair of claws. Crabs are invertebrates (animals without a backbone). Their exoskeleton protects them from predators and provides support for their bodies.",
    "dragonfly": "Dragonflies have long, delicate, membranous wings which are transparent and some have light yellow coloring near the tips. Their bodies are long and slender and they have a short antennae. Dragonflies are very colorful, for example the Green Darner Dargonfly has a green thorax and a blue segmented abdomen.",
    "oyster": "Oyster shells are usually oval or pear-shaped, but will vary widely in form depending on what they attach to. They are generally whitish-gray in outer shell color, and their inside shell is usually a porcelain white. They have extremely strong adductor muscles to close their shells when threatened.",
    "shark": "Sharks have a tough skin that is dull gray in colour and is roughened by toothlike scales. They also usually have a muscular, asymmetrical, upturned tail; pointed fins; and a pointed snout extending forward and over a crescentic mouth set with sharp triangular teeth.",
    "bee": "Like all insects, a bee's body is divided into three parts: a head with two antennae, a thorax with six legs, and an abdomen. All bees have branched hairs somewhere on their bodies and two pairs of wings. Only female bees have stingers (which are modified ovipositors, organs originally used to lay eggs).",
    "butterfly": "A butterfly is a flying insect with a small body and large, often colorful wings. Some gardeners plant specific flowers that attract butterflies. Butterflies are closely related to moths, which also have wings that are large in proportion to their bodies and antennae",
    "starfish": "There are over 1,500 different species of sea star, which come in many different shapes and sizes, but all of these animals consist of arms extending from a central disk. In most species, starfish have five arms, giving them a star-shaped appearance. They have spiny skin, and come in many different colors, including shades of red, purple, and yellow.",
    "grasshopper": "Grasshoppers are medium to large insects. Adult length is 1 to 7 cm, depending on the species. Like their relatives the katydids and crickets, they have chewing mouthparts, two pairs of wings, one narrow and tough, the other wide and flexible, and long hind legs for jumping.",
    "sparrow": "Sparrows are small birds. They are between 11–18 centimeters long. They can weigh between 13–42 grams. They are usually brown and grey. They have short tails and small, strong beaks.",
    "squid": "Squids have elongated tubular bodies and short compact heads with eyes on the sides of the head. Two of the ten arms have developed into long slender tentacles with expanded ends and four rows of suckers with toothed rings.",
    "hornbill": "Great hornbills are fairly large, ranging from 95 to 120 cm in length and featuring a wingspan of 151 to 178 cm. On average, they weigh 3 kg. They are vividly colored and easily recognizable. The body, head, and wings are primarily black; the abdomen and neck are white.",
    "penguin": "A penguin has a large head, short neck, and elongated body. The tail is short, stiff, and wedge-shaped. The legs and webbed feet are set far back on the body, which gives penguins their upright posture on land."
}